{
"data":[
    {
        "title":"More about JS",
        "desc":"Sejarah, dan lainnya terkait javascript",
        "content":"<h3>tambahan tentang javascript</h3>javascript adalah bahasa tingkat tinggi yang awalnya dikembangkan  dan dibuat oleh Brendan Eich pada tahun 1995. Awalnya ditujukan untuk membuat tampilan website menjadi lebih dinamis. Javascript adalah salah satu bahasa yang populer untuk mengembangkan aplikasi berbasis web. Seiring berkembangnya waktu muncul Node.js yang dibuat oleh Ryan Dahl. Dengan adanya Node.js ini kita dapat menjalankan Javascript di luar browser. Dengan adanya Node.js kita dapat dengan mudah membuat aplikasi baik itu front-end, back-end, maupun fullstack dengan sangat mudah.<br><h4> alasan memakai Javascript</h4>alasan utama memakai javascript karena Javascript adalah bahasa yang flexibel dalam development web. Seperti yang disampaikan kita dapat dengan mudah membuat aplikasi backend dan frotnend di dalamnya. Selain itu JS juga bersifat versatile yang artinya bisa dijalankan di browser, server, dan juga desktop. Alasan lainnya yang tidak kalah masuk akal adalah <b>gajinya cuy</b> rata-rata gaji frontend dev adalah Rp 7.300.000 per bulan dan Backend adalah Rp 9.200.000 per bulan (di Indonesia). Rata - rata lowongan pekerjaan tersebut memakai framework - framework javascript.<h4>JS nowadays</h4>saat ini sendiri javacript telah menjadi salah satu bahasa yang sangat populer. Komunitas yang dimiliki javascript juga sangatlah luas sehingga banyak sekali framework / library / dependancies yang dapat dimanfaatkan. Perkembangan yang cepat ini juga menyebabkan ada hal yang baru tentang javascript pada tiap harinya. Contoh implementasinya pada jaman ini adalah aplikasi instagram. Aplikasi instagram dibuat tidak menggunakan native android namun menggunakan React Native, bawaan dari ReactJS. ReactJS sendiri adalah framework yang dibuat oleh facebook (sekarang namanya meta), framework ini berfokus pada pembuatan interface frontend pada website. Tidak hanya website namun juga merambah ke device mobile menggunakan React Native. Selain itu juga pengembangan backend juga tidak boleh dilupakan. Dengan berbagai cara di javascript kita dapat dengan mudah mengimplementasikan javascript untuk membuat aplikasi backend seperti RESTful api, Graphql, RSS dan lainnya. Framework yang populer untuk pengembangan backend adalah ExpressJS, Fastify, Hapi dan lainnya. Bagaimana? luas sekali kan konsep javascript xD<br>bahkan blog ini dibuat di sveltekit (framework javascript cuy).",
        "date":"7-3-24",
        "imageurl":"https://th.bing.com/th/id/OIP.bKoUreksVYBGqYsPuGrgaQHaEK?rs=1&pid=ImgDetMain"
        
        
    },
    {
        "title":"Python 101 part 2",
        "desc":"Percabangan",
        "content":"<h3>Operator perbandingan</h3> pada operator perbandingan kita mempunyai konsep yang sama dengan bahasa pemrograman pada umumnya. Kita memiliki perbandingan AND, OR, NOT dan lainnya. Disini yang membuat unik adalah kita bisa mendeskripsikan perbandingan tersebut dengan banyak cara. Cara umumnya adalah dengan menggunakan <p style=\"background-color: #f1f1f1; color: blue; padding: 2px;\"># sama dengan<br>==<br># tidak sama dengan<br>!=.</p> Diatas adalah cara yang umum untuk mendefinisikan operator perbandingan. Ada beberapa cara lainnya yakni dengan menggunakan bahasa manusiawi <p style=\"background-color: #f1f1f1; color: blue; padding: 2px;\"># sama dengan<br>is<br># tidak sama dengan<br>is not<br># or<br> or<br>#and<br> and</p> contoh penggunaan bisa diaplikasikan di percabangan (if else). Sebelumnya if else di python bisa didefinisikan dengan: <p style=\"background-color: #f1f1f1; color: blue; padding: 2px;\">#percabangan if<br>if:<br># memberi statement lain dalam percabangan<br>else:<br># kalau percabangannya mau lebih satu maka bisa pakai v<br> elif <statement>:</p> berikut adalah contoh eksekusi program percabangan: <img src='https://media.discordapp.net/attachments/1023598916857499680/1214860312105451550/image.png?ex=65faa5d5&is=65e830d5&hm=c51fce48c660103a3456f4ab70b650f569400ed152d6e6a39c3026e0a1518dc0&=&format=webp&quality=lossless&width=1165&height=637'>",
        "date":"6-3-24",
        "imageurl":"https://i.pinimg.com/originals/c2/6a/58/c26a58af112f4cad08629893409f32c5.jpg"
    },
    {
        "title":"Python 101 part 1",
        "desc":"Variable dkk",
        "content": "Selamat datang dimatkul PAD saya Ong Gabriel Riverine Susanto angkatan 20 akan membantu teman - teman untuk berkenalan dengan python. Sebelumnya saya akan memberi alasan kenapa teman - teman harus mempelajari python.<ul><li>Sintaks mudah dan simple. Sintaks yang mudah dan simple adalah suatu hal yang istimewa di python. di python sendiri kita juga bisa menghindari <a href='https://refactory.id/blogs/post/2023-05-15-apa-yang-dimaksud-dengan-boilerplate-code'>Boilerplate</a> yang banyak sekali.</li><li>Komunitas yang besar. Komunitas yang besar membuat python tidak kalah saing dengan pemrograman yang populer lainnya (misal javascript) dengan komunitas yang besasr inilah python mempunyai banyak sekali library yang dapat dipakai. nah teman - teman akan berkenalan dan mempelajari library umum untuk analisa data setelah UTS.</li><li>Bahasa serbaguna. Tidak hanya untuk sekedar machine learning dan analisa data, python juga bisa untuk banyak hal. Misalnya saja untuk web programming. Python adalah salah satu bahasa pemrograman yang dapat digunakan untuk bahasa backend jika teman - teman ingin membuat aplikasi. Contoh hasilnya sendiri bisa di lihat pada repository saya siapa tau minat :P<br><a href=\\\"https://github.com/Techwaste\\\">Backend aplikasi Techwaste</a><br><a href=\\\"https://github.com/Riveong/Octavia\\\">Backend aplikasi Kasir</a><br><a href=\\\"https://github.com/MasTutor\\\">Backend aplikasi pencocokan murid dan guru</a><br><a href=\\\"https://github.com/AnimaLink\\\">Backend aplikasi marketplace hewan</a></li>Demikian dari gambaran singkat dari python. Tentunya python juga ada kelemahannya sendiri yakni harus install terlebih dahulu sebelum digunakan, tidak secepat bahsa pemrograman lainnya, dan beberapa kelemahan lainnya. Namun jika kita kesampingkan kelemahan yang tercantum, maka kita mendefinisikan python sebagai bahsa pemrograman yang powerful. Kelebihan - kelebihan yang tercantum adalah salah satu alasan kenapa kakak tingkat anda lebih sering pakai python daripada java / yang lainnya. Klo pake java ribet cuy mau print aja harus ketik 3 kalimat dlu 🗿. Terlebih lagi untuk machine learning sendiri python mempunyai banyak sekali library, hal ini dapat dimanfaatkan dengan baik mengingat kebanyakan dari kakak tingkat kalian skripsinya tentang machine learning.<hr><h3> Perkenalan sintaks python</h3>ok mari kita langsung saja masuk ke eksekusi. Jika teman - teman ingin membuat comment maka teman teman bisa memakai #<br><p style=\"background-color: #f1f1f1; color: blue; padding: 2px;\"># ini comment</p><br>kode tersebut tidak akan di eksekusi dan hanya jadi pajangan.<br>Untuk print teman teman bisa pakai:<p style=\"background-color: #f1f1f1; color: blue; padding: 2px;\">print(\"Hello World\")</p> atau <p style=\"background-color: #f1f1f1; color: blue; padding: 2px;\">print('Hello World')</p><br>Penggunaan petik satu dan petik dua tidak berpengaruh.<br>jika teman - teman ingin mendeklarasikan data / variable maka bisa dengan<br><p style=\"background-color: #f1f1f1; color: blue; padding: 2px;\">num = 1 #ini untuk int<br>num = \"1\" #ini untuk string<br>num = 0.1 #ini untuk double</p><br>jika teman - teman perhatikan baik baik maka dapat dilihat bahwa python tidak memperlukan pendklarasian variable terlebih dahulu. Karena python sendiri sudah secara automatis menentukan tipe data variable anda.<br>Untuk menampilkan data maka teman - teman dapat melakukan:<br><p style=\"background-color: #f1f1f1; color: blue; padding: 2px;\">num = 2 <br> print(num)</p><br> nah teman - teman bisa juga print dengan memanfaatkan fstring<br><p style=\"background-color: #f1f1f1; color: blue; padding: 2px;\">num = 2 <br>print(f\"hasilnya adalah {num})</p><br> Jika di print maka akan muncul hasil: hasilnya adalah 2<h3>Operasi di python</h3>sampai sini kita sudah bisa print dan membuat variable. Sekarang kita akan mencoba menggunakan operasi di python.<br><p style=\"background-color: #f1f1f1; color: blue; padding: 2px;\">+ untuk menjumlahkan <br> - untuk mengurangi <br> / untuk membagi <br> * untuk mengkali <br> % untuk modulo<br> ** untuk eksponen<br> // untuk divisi</p> <br> cara menggunakannya pun juga cukup simple. Anda bisa langsung menggunakannya.<p style=\"background-color: #f1f1f1; color: blue; padding: 2px;\">print(1+1)<br>print(2*2)<br>print(2-2)<br># anda juga dapat menggunakan variable untuk melakukan operasi!<br>num1 = 1<br> num2 = 2<br>result = num1+num2<br>print(result)</p> Silahkan amati dan jalankan baris blok diatas, setelah itu anda bisa mencoba operasi **, //, dan %. Kenapa hasilnya demikian?",
        "date":"6-3-24",
        "imageurl":"https://i.pinimg.com/originals/c2/6a/58/c26a58af112f4cad08629893409f32c5.jpg"

    },
    {
        "title":"How-to-Table",
        "desc":"How to make table in HTML",
        "content":"Halo teman - teman. Pada kesempatan kali ini kita akan membahas cara membuat tabel di HTML",
        "date":"3-12-23",
        "imageurl":"https://hooshmand.net/wp-content/uploads/2021/12/Microsoft-Excel-Table-in-google-sheets-cover.png"
    }
]
}
  
