{
"data":[
    {
        "title":"Python 101 part 1",
        "desc":"Variable dkk",
        "content": "Selamat datang dimatkul PAD saya Ong Gabriel Riverine Susanto angkatan 20 akan membantu teman - teman untuk berkenalan dengan python. Sebelumnya saya akan memberi alasan kenapa teman - teman harus mempelajari python.<ul><li>Sintaks mudah dan simple. Sintaks yang mudah dan simple adalah suatu hal yang istimewa di python. di python sendiri kita juga bisa menghindari <a href='https://refactory.id/blogs/post/2023-05-15-apa-yang-dimaksud-dengan-boilerplate-code'>Boilerplate</a> yang banyak sekali.</li><li>Komunitas yang besar. Komunitas yang besar membuat python tidak kalah saing dengan pemrograman yang populer lainnya (misal javascript) dengan komunitas yang besasr inilah python mempunyai banyak sekali library yang dapat dipakai. nah teman - teman akan berkenalan dan mempelajari library umum untuk analisa data setelah UTS.</li><li>Bahasa serbaguna. Tidak hanya untuk sekedar machine learning dan analisa data, python juga bisa untuk banyak hal. Misalnya saja untuk web programming. Python adalah salah satu bahasa pemrograman yang dapat digunakan untuk bahasa backend jika teman - teman ingin membuat aplikasi. Contoh hasilnya sendiri bisa di lihat pada repository saya siapa tau minat :P<br><a href=\\\"https://github.com/Techwaste\\\">Backend aplikasi Techwaste</a><br><a href=\\\"https://github.com/Riveong/Octavia\\\">Backend aplikasi Kasir</a><br><a href=\\\"https://github.com/MasTutor\\\">Backend aplikasi pencocokan murid dan guru</a><br><a href=\\\"https://github.com/AnimaLink\\\">Backend aplikasi marketplace hewan</a></li>Demikian dari gambaran singkat dari python. Tentunya python juga ada kelemahannya sendiri yakni harus install terlebih dahulu sebelum digunakan, tidak secepat bahsa pemrograman lainnya, dan beberapa kelemahan lainnya. Namun jika kita kesampingkan kelemahan yang tercantum, maka kita mendefinisikan python sebagai bahsa pemrograman yang powerful. Kelebihan - kelebihan yang tercantum adalah salah satu alasan kenapa kakak tingkat anda lebih sering pakai python daripada java / yang lainnya. Klo pake java ribet cuy mau print aja harus ketik 3 kalimat dlu 🗿. Terlebih lagi untuk machine learning sendiri python mempunyai banyak sekali library, hal ini dapat dimanfaatkan dengan baik mengingat kebanyakan dari kakak tingkat kalian skripsinya tentang machine learning.<hr><h3> Perkenalan sintaks python</h3>ok mari kita langsung saja masuk ke eksekusi. Jika teman - teman ingin membuat comment maka teman teman bisa memakai #<br><p style=\"background-color: #f1f1f1; color: blue; padding: 2px;\"># ini comment</p><br>kode tersebut tidak akan di eksekusi dan hanya jadi pajangan.<br>Untuk print teman teman bisa pakai:<p style=\"background-color: #f1f1f1; color: blue; padding: 2px;\">print(\"Hello World\")</p> atau <p style=\"background-color: #f1f1f1; color: blue; padding: 2px;\">print('Hello World')</p><br>Penggunaan petik satu dan petik dua tidak berpengaruh.<br>jika teman - teman ingin mendeklarasikan data / variable maka bisa dengan<br><p style=\"background-color: #f1f1f1; color: blue; padding: 2px;\">num = 1 #ini untuk int<br>num = \"1\" #ini untuk string<br>num = 0.1 #ini untuk double</p><br>jika teman - teman perhatikan baik baik maka dapat dilihat bahwa python tidak memperlukan pendklarasian variable terlebih dahulu. Karena python sendiri sudah secara automatis menentukan tipe data variable anda.<br>Untuk menampilkan data maka teman - teman dapat melakukan:<br><p style=\"background-color: #f1f1f1; color: blue; padding: 2px;\">num = 2 <br> print(num)</p><br> nah teman - teman bisa juga print dengan memanfaatkan fstring<br><p style=\"background-color: #f1f1f1; color: blue; padding: 2px;\">num = 2 <br>print(f\"hasilnya adalah {num})</p><br> Jika di print maka akan muncul hasil: hasilnya adalah 2<h3>Operasi di python</h3>sampai sini kita sudah bisa print dan membuat variable. Sekarang kita akan mencoba menggunakan operasi di python.<br><p style=\"background-color: #f1f1f1; color: blue; padding: 2px;\">+ untuk menjumlahkan <br> - untuk mengurangi <br> / untuk membagi <br> * untuk mengkali <br> % untuk modulo<br> ** untuk eksponen<br> // untuk divisi</p> <br> cara menggunakannya pun juga cukup simple. Anda bisa langsung menggunakannya.<p style=\"background-color: #f1f1f1; color: blue; padding: 2px;\">print(1+1)<br>print(2*2)<br>print(2-2)<br># anda juga dapat menggunakan variable untuk melakukan operasi!<br>num1 = 1<br> num2 = 2<br>result = num1+num2<br>print(result)</p> Silahkan amati dan jalankan baris blok diatas, setelah itu anda bisa mencoba operasi **, //, dan %. Kenapa hasilnya demikian?",
        "date":"6-3-24",
        "imageurl":"https://i.pinimg.com/originals/c2/6a/58/c26a58af112f4cad08629893409f32c5.jpg"

    },
    {
        "title":"How-to-Table",
        "desc":"How to make table in HTML",
        "content":"Halo teman - teman. Pada kesempatan kali ini kita akan membahas cara membuat tabel di HTML",
        "date":"3-12-23",
        "imageurl":"https://hooshmand.net/wp-content/uploads/2021/12/Microsoft-Excel-Table-in-google-sheets-cover.png"
    }
]
}
  
